In [1]:
# Modules
import pandas as pd

In [11]:
# Load lotto data

data_file_names = ['mini-lottowyniki 2019',
                   'mini-lottowyniki 2020',
                   'mini-lottowyniki 2021',
                   'mini-lottowyniki 2022']

df_lotto_results = pd.DataFrame()

for name in data_file_names:
    df_lotto_results = df_lotto_results.append(pd.read_csv(f'data/{name}.csv', sep=';'), ignore_index=True)

In [12]:
df_lotto_results.head(10)

     id  day  month  year  N1  N2  N3  N4  N5
0  4865   31     12  2019   6   8  12  31  40
1  4864   30     12  2019  13  21  33  35  41
2  4863   29     12  2019   1   5   9  14  35
3  4862   28     12  2019   5  12  20  27  35
4  4861   27     12  2019   1   4  10  14  23
5  4860   26     12  2019  12  16  22  29  35
6  4859   25     12  2019   3  13  23  24  36
7  4858   24     12  2019   6  12  17  32  35
8  4857   23     12  2019   2  10  12  34  37
9  4856   22     12  2019   5   7  17  31  42

In [13]:
# Cutting off unnecessary data

df_lotto_results = df_lotto_results[['N1', 'N2', 'N3', 'N4', 'N5']]

In [14]:
# Numbers are sorted, creating unique strings of five numbers

df_lotto_results['all_numbers'] = df_lotto_results.N1.astype(str) + ', ' +  df_lotto_results.N2.astype(str) + ', '\
+  df_lotto_results.N3.astype(str) + ', ' +  df_lotto_results.N4.astype(str) + ', ' +  df_lotto_results.N5.astype(str) 
df_lotto_results

      N1  N2  N3  N4  N5         all_numbers
0      6   8  12  31  40    6, 8, 12, 31, 40
1     13  21  33  35  41  13, 21, 33, 35, 41
2      1   5   9  14  35     1, 5, 9, 14, 35
3      5  12  20  27  35   5, 12, 20, 27, 35
4      1   4  10  14  23    1, 4, 10, 14, 23
...   ..  ..  ..  ..  ..                 ...
1328   9  11  20  21  37   9, 11, 20, 21, 37
1329   5   7   8  11  30     5, 7, 8, 11, 30
1330   4  10  20  40  42   4, 10, 20, 40, 42
1331   2   7  23  37  42    2, 7, 23, 37, 42
1332   3   4  28  33  42    3, 4, 28, 33, 42

[1333 rows x 6 columns]

In [15]:
# Group by unique results and count them

df_counted_results = df_lotto_results.groupby(['all_numbers'])['all_numbers'].count()

In [17]:
# Sort the results to find the most frequent fives 

df_counted_results.sort_values(ascending=False).head(150)

all_numbers
1, 10, 12, 21, 33    1
4, 8, 15, 30, 34     1
4, 8, 15, 17, 18     1
4, 8, 14, 23, 24     1
4, 8, 13, 21, 24     1
                    ..
5, 12, 38, 39, 40    1
5, 13, 14, 22, 31    1
5, 13, 14, 27, 32    1
5, 14, 22, 37, 42    1
5, 16, 19, 22, 37    1
Name: all_numbers, Length: 150, dtype: int64

In [18]:
# In the proven period of time, none of the fives has happened again